artillery/multi-agent-test.yml
# SmellPin Artillery 多Agent模拟测试配置
# 模拟真实用户行为的多Agent测试

config:
  target: 'http://localhost:3001'
  phases:
    # Agent热身阶段
    - duration: 120
      arrivalRate: 5
      name: "Multi-agent warmup"
    
    # Agent活跃阶段  
    - duration: 480  # 8分钟
      arrivalRate: 20
      rampTo: 60
      name: "Multi-agent active phase"
    
    # Agent交互阶段
    - duration: 300  # 5分钟
      arrivalRate: 60
      name: "Multi-agent interaction phase"

  # 多Agent配置
  processor: "./artillery/processors/multi-agent-processor.js"
  
  http:
    timeout: 30
    pool: 80
    
  # 自定义指标收集
  plugins:
    publish-metrics:
      type: "cloudwatch"
      region: "us-east-1"

scenarios:
  # Agent类型1: 新用户探索者
  - name: "New User Explorer Agent"
    weight: 20
    flow:
      # 注册新用户
      - post:
          url: "/api/v1/users/register"
          name: "Agent_NewUser_Register"
          beforeRequest: "generateNewUserData"
          json:
            username: "{{ newUsername }}"
            email: "{{ newEmail }}"
            password: "{{ newPassword }}"
            firstName: "{{ newFirstName }}"
            lastName: "{{ newLastName }}"
          capture:
            - json: "$.data.id"
              as: "agentUserId"
            - json: "$.data.username"
              as: "agentUsername"

      - think: "{{ $randomFloat(3, 8) }}" # 新用户会花更多时间

      # 登录
      - post:
          url: "/api/v1/users/login"
          name: "Agent_NewUser_Login"
          json:
            email: "{{ newEmail }}"
            password: "{{ newPassword }}"
          capture:
            - json: "$.data.token"
              as: "agentToken"

      - think: "{{ $randomFloat(5, 15) }}" # 探索时间

      # 浏览标注列表
      - get:
          url: "/api/v1/annotations/list"
          name: "Agent_NewUser_Browse"
          qs:
            page: 1
            limit: 20
            sortBy: "created_at"

      - think: "{{ $randomFloat(10, 20) }}" # 阅读时间

      # 查看附近标注  
      - get:
          url: "/api/v1/annotations/nearby"
          name: "Agent_NewUser_Explore_Nearby"
          qs:
            latitude: "{{ $randomFloat(39.85, 39.95) }}"
            longitude: "{{ $randomFloat(116.35, 116.45) }}"
            radius: 2000

      - think: "{{ $randomFloat(15, 30) }}" # 新用户决策时间较长

      # 创建第一个标注
      - post:
          url: "/api/v1/annotations"
          name: "Agent_NewUser_First_Annotation"
          headers:
            Authorization: "Bearer {{ agentToken }}"
          beforeRequest: "generateAnnotationData"
          json:
            title: "{{ annotationTitle }}"
            description: "{{ annotationDescription }}"
            smellType: "{{ smellType }}"
            intensity: "{{ intensity }}"
            latitude: "{{ latitude }}"
            longitude: "{{ longitude }}"
            locationName: "{{ locationName }}"

  # Agent类型2: 活跃用户
  - name: "Active User Agent"
    weight: 30
    flow:
      # 快速登录
      - post:
          url: "/api/v1/users/login"
          name: "Agent_Active_Login"
          beforeRequest: "getActiveUserCredentials"
          json:
            email: "{{ activeUserEmail }}"
            password: "{{ activeUserPassword }}"
          capture:
            - json: "$.data.token"
              as: "activeToken"
            - json: "$.data.user.id"
              as: "activeUserId"

      - think: "{{ $randomFloat(1, 3) }}" # 活跃用户行动更快

      # 批量操作模拟
      - loop:
          over: "annotationIds"
          loopElement: "annotationId"
          flow:
            - get:
                url: "/api/v1/annotations/{{ annotationId }}"
                name: "Agent_Active_View_Annotation"
                
            - think: "{{ $randomFloat(0.5, 2) }}"
                
            # 随机点赞
            - post:
                url: "/api/v1/annotations/{{ annotationId }}/like"
                name: "Agent_Active_Like"
                headers:
                  Authorization: "Bearer {{ activeToken }}"
                ifTrue: "{{ $randomFloat(0, 1) > 0.7 }}" # 70%概率点赞

      # 创建多个标注
      - loop:
          count: "{{ $randomInt(2, 5) }}"
          flow:
            - post:
                url: "/api/v1/annotations"
                name: "Agent_Active_Create_Multiple"
                headers:
                  Authorization: "Bearer {{ activeToken }}"
                beforeRequest: "generateRandomAnnotation"
                json:
                  title: "{{ randomTitle }}"
                  description: "{{ randomDescription }}"
                  smellType: "{{ randomSmellType }}"
                  intensity: "{{ randomIntensity }}"
                  latitude: "{{ randomLatitude }}"
                  longitude: "{{ randomLongitude }}"
                capture:
                  - json: "$.data.id"
                    as: "newAnnotationId"

            - think: "{{ $randomFloat(2, 5) }}"

  # Agent类型3: 搜索用户
  - name: "Search User Agent"
    weight: 25
    flow:
      # 各种搜索行为
      - loop:
          count: "{{ $randomInt(3, 8) }}"
          flow:
            - get:
                url: "/api/v1/search"
                name: "Agent_Search_Query"
                beforeRequest: "generateSearchQuery"
                qs:
                  q: "{{ searchQuery }}"
                  type: "annotations"
                  limit: "{{ $randomInt(10, 30) }}"
                  
            - think: "{{ $randomFloat(2, 5) }}"
            
            # 地理搜索
            - get:
                url: "/api/v1/annotations/nearby"
                name: "Agent_Search_Geographic"
                beforeRequest: "generateGeoSearch"
                qs:
                  latitude: "{{ geoLat }}"
                  longitude: "{{ geoLng }}"
                  radius: "{{ geoRadius }}"
                  limit: 15

            - think: "{{ $randomFloat(1, 3) }}"

  # Agent类型4: 社交用户
  - name: "Social User Agent"
    weight: 15
    flow:
      - post:
          url: "/api/v1/users/login"
          name: "Agent_Social_Login"
          beforeRequest: "getSocialUserCredentials"
          json:
            email: "{{ socialUserEmail }}"
            password: "{{ socialUserPassword }}"
          capture:
            - json: "$.data.token"
              as: "socialToken"

      # 社交互动循环
      - loop:
          count: "{{ $randomInt(10, 20) }}"
          flow:
            # 随机浏览标注
            - get:
                url: "/api/v1/annotations/list"
                name: "Agent_Social_Browse"
                qs:
                  page: "{{ $randomInt(1, 5) }}"
                  limit: 10
                  sortBy: "like_count"
                capture:
                  - json: "$.data.annotations[*].id"
                    as: "socialAnnotationIds"

            - think: "{{ $randomFloat(1, 3) }}"

            # 社交互动
            - post:
                url: "/api/v1/annotations/{{ $randomItem(socialAnnotationIds) }}/like"
                name: "Agent_Social_Like"
                headers:
                  Authorization: "Bearer {{ socialToken }}"
                expect:
                  - statusCode: [200, 400]

            - think: "{{ $randomFloat(0.5, 2) }}"

  # Agent类型5: 移动用户（模拟移动设备行为）
  - name: "Mobile User Agent"
    weight: 10
    flow:
      - post:
          url: "/api/v1/users/login"
          name: "Agent_Mobile_Login"
          headers:
            User-Agent: "SmellPin-Mobile/1.0 (iPhone; iOS 15.0)"
          beforeRequest: "getMobileUserCredentials"
          json:
            email: "{{ mobileUserEmail }}"
            password: "{{ mobileUserPassword }}"
          capture:
            - json: "$.data.token"
              as: "mobileToken"

      # 模拟移动设备的位置更新
      - loop:
          count: "{{ $randomInt(5, 10) }}"
          flow:
            - get:
                url: "/api/v1/annotations/nearby"
                name: "Agent_Mobile_Location_Update"
                headers:
                  User-Agent: "SmellPin-Mobile/1.0"
                beforeRequest: "simulateMovement"
                qs:
                  latitude: "{{ currentLat }}"
                  longitude: "{{ currentLng }}"
                  radius: 500  # 移动设备通常查询较小范围

            - think: "{{ $randomFloat(5, 15) }}" # 移动中的停留时间

            # 可能创建位置相关的标注
            - post:
                url: "/api/v1/annotations"
                name: "Agent_Mobile_Create_Location_Annotation"
                headers:
                  Authorization: "Bearer {{ mobileToken }}"
                  User-Agent: "SmellPin-Mobile/1.0"
                ifTrue: "{{ $randomFloat(0, 1) > 0.8 }}" # 20%概率创建
                beforeRequest: "generateMobileAnnotation"
                json:
                  title: "{{ mobileTitle }}"
                  description: "{{ mobileDescription }}"
                  smellType: "{{ mobileSmellType }}"
                  intensity: "{{ mobileIntensity }}"
                  latitude: "{{ currentLat }}"
                  longitude: "{{ currentLng }}"
                  deviceInfo:
                    platform: "mobile"
                    device: "iPhone"

before:
  flow:
    - log: "Starting Multi-Agent simulation test"

after:
  flow:
    - log: "Multi-Agent simulation completed"